[
  {
    "date": "April 26, 2025",
    "text": "Grading for the 2025 Invitational Round has concluded. Participant scores, individual medals/awards, best solution awards, and the USA and Anglophone Canada team assignments for the 2025 IOL can be accessed here. Thank you for participating in NACLO 2025!",
    "link": "https://naclo.org/2025/NACLO_2025_Invitational_Round_Results.pdf"
  },
  {
    "date": "February 14, 2025",
    "text": "Grading for the 2025 Open Round has concluded and your score is available in your student account. The list of students who have qualified for the Invitational Round has been released.",
    "link": "https://naclo.org/2025/topscores-2025-r1.txt"
  },
  {
    "date": "February 8, 2025",
    "text": "We have published the list of submitted booklets. If you are a student and don't see your booklet here, please contact your site host.",
    "link": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIzhVPH2PMev0xqGy-m0C4INE1ng99OtH8AVnQWXRFvlEULs3y45IpvpBXPCTb7gcsoASBxn2yvPIL/pubhtml?gid=0&single=true"
  },
  {
    "date": "January 30, 2025",
    "text": "Thank you to all who participated in the first round of NACLO 2025! Scores will be posted by the end of February. The Invitational Round will take place on Thursday, March 13, 2025.",
    "link": "https://example.com/scores"
  },
  {
    "date": "January 16, 2025",
    "text": "Registration for NACLO will close on Monday, January 20th at 10 p.m. EST. Site registration will close at the same time. Some sites may accept walk-ins.",
    "link": "https://naclo.org/registration_page.php"
  },
  {
    "date": "October 10, 2024",
    "text": "Registration is now open for the Open Round of the competition on January 23, 2025. Register here!",
    "link": "https://naclo.org/registration_page.php"
  },
  {
    "date": "September 8, 2024",
    "text": "Registration for NACLO 2025 has not yet opened. Registration will open soon, so keep an eye on this page for updates.",
    "link": "https://naclo.org/registration_page.php"
  },
  {
    "date": "August 15, 2024",
    "text": "Press Release about the performance of the NACLO teams at the 2024 IOL.",
    "link": "https://naclo.org/2024/2024-NACLO-post-IOL-Press-Release.pdf"
  },
  {
    "date": "June 26, 2024",
    "text": "NACLO 2025 will be on January 23, 2025 (Open Round) and March 13, 2025 (Invitational Round).",
    "link": "https://naclo.org"
  },
  {
    "date": "April 19, 2024",
    "text": "Grading for the 2024 Invitational Round has concluded. Participant scores, best problem solution awards, and the USA and Anglophone Canada team assignments for the 2024 IOL can be accessed here.",
    "link": "https://naclo.org/2024/NACLO-2024-Invitational-Round-Results.pdf"
  },
  {
    "date": "February 26, 2024",
    "text": "Grading for the 2024 Open Round has concluded and your score is available in your student account. The list of students who have qualified for the Invitational Round has been released.",
    "link": "https://naclo.org/2024/topscores-2024-r1.txt"
  },
  {
    "date": "January 25, 2024",
    "text": "The 2024 NACLO Open Round took place on January 25, 2024. Registration is now closed for this academic year.",
    "link": "https://example.com"
  },
  {
    "date": "September 26, 2023",
    "text": "Registration is now open for the Open Round of the competition on January 25, 2024. Register Here!",
    "link": "https://naclo.org/registration_page.php"
  },
  {
    "date": "April 10, 2023",
    "text": "Grading for the 2023 Invitational Round has concluded. Participant scores, best problem solution awards, and the USA and Anglophone Canada team assignments for the 2023 IOL can be accessed here.",
    "link": "https://naclo.org/2023/NACLO-2023-Invitational-Round-Results.pdf"
  }
]
